1s/ERP/Conf/Documents/Лико_ЗаказНаРаскрой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаказНаРаскрой</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_РаскройМатериаловПланФакт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ЭтапыВыполненияЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураВыпуск</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочныйМетражРезки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодрезкаКромка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлениеРоликов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормативРезки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполненияПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаскройСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыЗаказовБЭ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполненияПланВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПараметрыРасчетаРаскрояМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНастройкиПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНастройкиПланВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРаботыПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяРаботыПланВремя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериалНаМашине</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ОбъектРезерва</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Раскрой</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоРоликов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлинаРолика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СнятьРезерв</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеПоРаскрою</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Печатник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Смена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетражПоЗаказу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПечати</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБланка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Enums/ЯС_ВидыШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЯС_ВидыШК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ШК_Паллета</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Адреса</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Управляющий</Name>
					<Comment>ЯС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Коробки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Сотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Заказа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_УпаковочныйЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ОбъектаНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ЗаявкаНаСклад</Name>
					<Comment>Старая</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_НомерБобины</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_КодПродукта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_ИнформацияОПродукте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_УпотребитьДо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_НомерЗаказаКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EPSMA_Roll_ID</Name>
					<Comment>Штрих-код EPSMA Roll ID короткий. (Правай часть от Roll Number)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_Товароместо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_РабочегоЦентра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_ПриходРасходТовароместа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SQL_ТовароместоUID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ЗаказаСпецификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Конверта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ОбъектаНоменклатуры_Короткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Адреса_Короткий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_СотрудникаПолныйКод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ВходящихДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Растарки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Тара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_КартаСнятияПерерасхода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_ТипоразмерПаллета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШК_Паллета2_0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаказНаРаскрой/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	Если Объект.Номенклатура<>Неопределено Тогда
		Код=Объект.Номенклатура.Код;
	КонецЕсли;
	
	Если Объект.НоменклатураВыпуск<>Неопределено Тогда
		КодВыпуск=Объект.НоменклатураВыпуск.Код;
	КонецЕсли;
	
	СразуНаПринтер=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("СразуНаПринтер");
	ПечатьЗаказНаРаскрой=Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ПечатьЗаказаНаРаскрой");
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	// Подсистема WebSocket
	ПоказыватьQRCode=Ложь;
	WebSocketСервер.Инициализация(ЭтаФорма,ПоказыватьQRCode);
	// Подсистема WebSocket
	//
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	
	РедактированиеОрганизации();
	
    ЗаполнитьСтатистикуСервер();
	
	Если Документы.Лико_УстановкаРезерваМатериалов.СтартРезевированияПодРегионы() Тогда
		
		Элементы.Резерв.Видимость=Истина;
		Элементы.Партнер.Видимость = Ложь;
	Иначе
		Элементы.Резерв.Видимость = Ложь;
		Элементы.Партнер.Видимость = Истина;

				
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);  	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры



#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда,Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура НоменклатураПриИзмененииНаСервере()
Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда	
	
	Код=Объект.Номенклатура.Код;
КонецЕсли;

Если ЗначениеЗаполнено(Объект.НоменклатураВыпуск) Тогда	
	КодВыпуск=Объект.НоменклатураВыпуск.Код;
КонецЕсли;
ЗаполнитьСтатистикуСервер();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если Объект.Проведен  И ПечатьЗаказНаРаскрой ТОгда
		//СразуНаПринтер=Истина;
		
		ВыполняемаяОбработка=НайтиПФ("Печатная форма документа ""Заказ на раскрой"" (бланк раскроя)");
		Если ВыполняемаяОбработка.Пустая() Тогда
			Возврат;
		КонецЕсли;
		ОбъектыНазначения=Новый Массив;
		ОбъектыНазначения.Добавить(Объект.Ссылка);
		//Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ОбъектыНазначения) Тогда
		ПараметрыОткрытия=Новый Структура("ИсточникДанных, ПараметрыИсточника");
		ПараметрыОткрытия.ИсточникДанных=ВыполняемаяОбработка;
		ПараметрыОткрытия.ПараметрыИсточника=Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
		ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды="ЗаказНаРаскройБланкРаскроя";
		ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения=ОбъектыНазначения;
		
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия,ЭтаФорма); 
		
		
	КонецЕсли;
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды



&НаСервереБезКонтекста
Функция НайтиПФ(Наименование)
	Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию(Наименование); 
КонецФункции

&НаКлиенте
Процедура ЭтапПриИзменении(Элемент)
	
КонецПроцедуры

&НаСервере
Процедура ЗагузитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(Лико_БланкЭтапаТовары.КоличествоРасход) КАК МетражПоЗаказу,
	|	Лико_БланкЭтапаТовары.Характеристика.ЯССМ_Нарезка КАК Нарезка,
	|	Лико_БланкЭтапаТовары.Ссылка.Сотрудник КАК Печатник,
	|	Лико_БланкЭтапаТовары.Ссылка.Дата КАК ДатаПечати,
	|	Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр КАК РабочийЦентр,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерБланка КАК НомерБланка
	|ИЗ
	|	Документ.Лико_БланкЭтапа.Товары КАК Лико_БланкЭтапаТовары
	|ГДЕ
	|	Лико_БланкЭтапаТовары.Ссылка.ЗаказНаРаскрой = &ЗаказНаРаскрой
	|	И Лико_БланкЭтапаТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_БланкЭтапаТовары.Характеристика.ЯССМ_Нарезка,
	|	Лико_БланкЭтапаТовары.Ссылка.Сотрудник,
	|	Лико_БланкЭтапаТовары.Ссылка.Дата,
	|	Лико_БланкЭтапаТовары.Ссылка.РабочийЦентр,
	|	Лико_БланкЭтапаТовары.Ссылка.НомерБланка";
	Запрос.УстановитьПараметр("ЗаказНаРаскрой",Объект.Ссылка );
	Объект.ДанныеПоРаскрою.Загрузить( Запрос.Выполнить().Выгрузить());
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Загузить(Команда)
	
	ОписаниеОповещения= Новый ОписаниеОповещения("ЗагузитьЗавершение",ЭтаФорма);
	Режим = РежимДиалогаВопрос.ДаНет; 
	ПоказатьВопрос(ОписаниеОповещения,"Таблица будет очищена!. Продолжить?",Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагузитьЗавершение (РезультатФормы,ПараметрыФормы) Экспорт//+Лико m.shenderov 25.05.2018
	Если РезультатФормы = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗагузитьНаСервере();	
КонецПроцедуры //-Лико m.shenderov 25.05.2018

&НаКлиенте
Процедура НоменклатураВыпускПриИзменении(Элемент)
		НоменклатураПриИзмененииНаСервере();

КонецПроцедуры




#КонецОбласти


&НаКлиенте
Процедура УстановитьВидимость() //+Лико m.shenderov 27.10.2018
	Если Объект.ВидРабот=ПредопределенноеЗначение("Справочник.ВидыРаботСотрудников.Активация") ТОгда
		Элементы.НоменклатураВыпуск.Видимость=Истина;
	Иначе
		Элементы.НоменклатураВыпуск.Видимость=Ложь;
	КонецЕсли;
	

	
КонецПроцедуры //-Лико m.shenderov 27.10.2018

&НаКлиенте
Процедура ВидРаботПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");

	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	

КонецПроцедуры



&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда 			
			
			Сообщить(Результат.Ошибка); 				
	Иначе
					
		Если Результат.ВидШК = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Перечисления.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			//Это физ. лицо
			
			Объект.Ответственный = Результат.Сотрудник;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий") Или 			
			Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры") Тогда
			
			
			Если Не ЗначениеЗаполнено(Результат.ОбъектНоменклатуры) Тогда  				
				Сообщить("Штрих код не найден! "+ Результат.ШК);
				Возврат;	
			КонецЕсли;			
			ОбработатьШКНоменклатуры(Результат);					
		Иначе
			//ОбработатьШтрихкодыТиповой(ДанныеШтрихкода);			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ОбработатьШКНоменклатуры(Результат);
	
ОбъектНоменклатуры			=Результат.ОбъектНоменклатуры;
//ОбъектНоменклатуры			=Справочники.ЯССМ_ОбъектыНоменклатуры.СоздатьЭлемент();
Объект.Номенклатура			=ОбъектНоменклатуры.Номенклатура;
Объект.Нарезка				=ОбъектНоменклатуры.Нарезка;
Объект.КоличествоУпаковок	=ОбъектНоменклатуры.Количество; 

Если Объект.Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда
	Если Не ЗначениеЗаполнено(Объект.ВидРабот) Тогда
    	Объект.ВидРабот     =Справочники.ВидыРаботСотрудников.РаскройМатериала;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда
    	Объект.РабочийЦентр     =Справочники.РабочиеЦентры.НайтиПоНаименованию("Перемотка",Истина);
	КонецЕсли;
КонецЕсли;
	
		
КонецПроцедуры //-Лико m.shenderov 14.01.2018

// Подсистема WebSocket
&НаКлиенте
Процедура WebSocketURLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	WebSocketКлиент.ОбработкаСообщения(ЭтаФорма,Элемент, ДанныеСобытия, СтандартнаяОбработка);	
КонецПроцедуры  

&НаКлиенте
Процедура WebSocketОбработкаШтрихКода() Экспорт 
	Если ВводДоступен() Тогда
		ОбработатьШтрихкоды(WebSocketMessage.content.ScanData);
	КонецЕсли;   
КонецПроцедуры 

// Подсистема WebSocket

&НаСервере
Процедура РедактированиеОрганизации() //+Лико m.shenderov 28.11.2022

	Если РольДоступна("ПолныеПрава") Или РольДоступна("Лико_ИзменениеОрганизацииВЗаказеНаРаскрой") Тогда
		
		Элементы.Организация.Вид=ВидПоляФормы.ПолеВвода;
		
	КонецЕсли;
	
	
	
	
	
КонецПроцедуры  //-Лико m.shenderov 28.11.2022

&НаКлиенте
Процедура РаскройДлиннаРоликаПриИзменении(Элемент)
	ДлинаРолика=Элементы.Раскрой.ТекущиеДанные.ДлинаРолика;
КонецПроцедуры

&НаКлиенте
Процедура РаскройПриИзменении(Элемент)
	ТД=Элементы.Раскрой.ТекущиеДанные;
	Если ТД<>Неопределено И Не ЗначениеЗаполнено(ТД.ДлинаРолика) Тогда
		
		Элементы.Раскрой.ТекущиеДанные.ДлинаРолика=ДлинаРолика;
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаказКлиентаПриИзмененииНаСервере() //+Лико m.shenderov 18.07.2022
   Структура=Документы.Лико_ЗаказНаРаскрой.ПолучитьДанныеЗаказуКлиента(Объект.ЗаказКлиента);
   
   Если ЗначениеЗаполнено(Структура) Тогда
	   ЗаполнитьЗначенияСвойств(Объект,Структура);
   КонецЕсли;
   

	
КонецПроцедуры  //-Лико m.shenderov 18.07.2022

&НаКлиенте
Процедура ЗаказКлиентаПриИзменении(Элемент)
	ЗаказКлиентаПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатистикуСервер() //+Лико m.shenderov 02.10.2023
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТопНарезокПоИспользованию.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		
		 Номенклатура= ?(ТипЗнч(Объект.Номенклатура)=Тип("СправочникСсылка.Номенклатура"),Объект.Номенклатура,Объект.Номенклатура.ОсновнаяНоменклатура);
		 
		 ТопНарезокПоИспользованию.Загрузить(
		 Документы.Лико_ЗаказНаРаскрой.ПолучитьСтатистикуПоНарезке(Объект.Организация,Номенклатура).Выгрузить());
		
	КонецЕсли;
	
	
КонецПроцедуры  //-Лико m.shenderov 02.10.2023
